Backrooms/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйОрганизатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщедоступнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМероприятий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокУчастников</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределения</name>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>CatalogRef.Распределения</types>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/Enums/СтатусыМероприятий/СтатусыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМероприятий</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликованное</name>
  </enumValues>
  <enumValues>
    <name>Внутреннее</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Catalogs/Мероприятия/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Элементы.ОбщедоступнаяРегистрация = (Объект.Статус = Перечисления.СтатусыМероприятий.Опубликованное);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбщедоступнаяРегистрацияПриИзмененииНаСервере()
	Если Объект.ОбщедоступнаяРегистрация Тогда
		Объект.Статус = Перечисления.СтатусыМероприятий.Черновик;
	Иначе
		Объект.Статус = Перечисления.СтатусыМероприятий.Внутреннее;
	КонецЕсли;	
	
	Элементы.ГруппаСписокУчастников.Видимость = НЕ Объект.ОбщедоступнаяРегистрация;
КонецПроцедуры

&НаКлиенте
Процедура ОбщедоступнаяРегистрацияПриИзменении(Элемент)
	ОбщедоступнаяРегистрацияПриИзмененииНаСервере();
КонецПроцедуры
